Content/20240704132635-elk.org
:PROPERTIES:
:ID:       a5d7c19d-d30a-466a-bac3-14d111278fcd
:END:
#+title: BLEK : beats, logstash, elastic search, kibana
#+filetags: :tool:data:

* Abstract
 - The usual log management stack : more inclined towards a reactive analysis.
 - for a more real time (and predictive) analysis, checkout the [[id:8f401b28-efb8-49e3-b1c6-02f101341669][Monitoring]] node
 - checkout [[id:791d861e-f535-4c49-9cb2-8cb8539fc619][Opensearch (& Dashboard)]], BLEK isn't open source anymore
   - has the premium features of BLEK and is open source (Apache 2.0 OSL)
* Components:
 - Beats: Lightweight data shippers on edge devices forward data to Logstash
 - Logstash:  ingests, transforms, and ships data from various sources into Elasticsearch
 - Elasticsearch: A [[id:a3d0278d-d7b7-47d8-956d-838b79396da7][distributed]], [[id:88828c6f-87e0-4569-b236-dc6ebb72d282][RESTful]] [[id:656af4b9-648b-41f9-932b-cbf2d2017794][search]] and analytics engine.
 - Kibana: A visualization and exploration tool
* Data Flow (Unbuffered)

#+begin_src

    [Web Server]:::B(Apache Logs)===O
                                     \
 [Load Balancer]:::::B(NGINX Logs)====O
                                       \
 [Application Server]::B(App Logs)======O-->[Logstash]-->[Elasticsearch]-->[Kibana]
                                       /
 [Database]::B(MySQL Logs)============O

B = Beats
#+end_src

- Various sources (web server, app server, etc.) generate logs.
- Beats installed on edge devices push these logs to logstash
- Logstash collects, processes, and normalizes these diverse logs.
- Processed logs are sent to Elasticsearch for indexing and storage.
- Kibana queries and visualizes the indexed data from Elasticsearch.

* Data Flow (Buffered)
#+begin_src
    [Web Server]:::B(Apache Logs)===O
                                     \
 [Load Balancer]:::::B(NGINX Logs)====O
                                       \   |  RMQ   |
 [Application Server]::B(App Logs)======O--| Buffer |-->[Logstash]-->[Elasticsearch]-->[Kibana]
                                       /   | AKafka |
 [Database]::B(MySQL Logs)============O

B = Beats
#+end_src

* Installation
- check out https://logz.io/learn/complete-guide-elk-stack/#installing-elk
- docker + [[id:abbce407-072f-4c39-9580-a8d6256dbe69][config managment]] systems
* diff w/ [[id:8f401b28-efb8-49e3-b1c6-02f101341669][Monitoring]]

| Feature         | Log Management (e.g., BLEK)        | Monitoring (e.g., Prometheus)        |
|-----------------+------------------------------------+--------------------------------------|
| Focus           | Textual log data analysis          | Numerical time-series metrics        |
| Data Structure  | Unstructured or semi-structured    | Structured, numerical                |
| Data Collection | Centralized from various sources   | Pull-based from instrumented systems |
| Use Cases       | Troubleshooting, security auditing | Performance monitoring, alerting     |

* Pre-emptive v Reactive Analysis

* Resources
- https://www.elastic.co/elastic-stack
- https://logz.io/learn/complete-guide-elk-stack/
- https://github.com/deviantony/docker-elk
- https://github.com/opensearch-project/OpenSearch
