Content/20240704132635-elk.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-05 Fri 12:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>BLEK : beats, logstash, elastic search, kibana</title>
<meta name="author" content="Raj Patil" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">BLEK : beats, logstash, elastic search, kibana</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4e1a16c">1. Abstract</a></li>
<li><a href="#org055bf2f">2. Components:</a></li>
<li><a href="#orgce067e6">3. Data Flow (Unbuffered)</a></li>
<li><a href="#orgfd53dad">4. Data Flow (Buffered)</a></li>
<li><a href="#org67efc42">5. Installation</a></li>
<li><a href="#org856aeef">6. diff w/ Monitoring</a></li>
<li><a href="#org86c119c">7. Pre-emptive v Reactive Analysis</a></li>
<li><a href="#orgd0d5217">8. Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4e1a16c" class="outline-2">
<h2 id="org4e1a16c"><span class="section-number-2">1.</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>The usual log management stack : more inclined towards a reactive analysis.</li>
<li>for a more real time (and predictive) analysis, checkout the <a href="20240704135955-monitoring.html#ID-8f401b28-efb8-49e3-b1c6-02f101341669">Monitoring</a> node</li>
<li>checkout <a href="20240704133744-opensearch.html#ID-791d861e-f535-4c49-9cb2-8cb8539fc619">Opensearch (&amp; Dashboard)</a>, BLEK isn&rsquo;t open source anymore
<ul class="org-ul">
<li>has the premium features of BLEK and is open source (Apache 2.0 OSL)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org055bf2f" class="outline-2">
<h2 id="org055bf2f"><span class="section-number-2">2.</span> Components:</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Beats: Lightweight data shippers on edge devices forward data to Logstash</li>
<li>Logstash:  ingests, transforms, and ships data from various sources into Elasticsearch</li>
<li>Elasticsearch: A <a href="20240219150231-distributed_compute.html#ID-a3d0278d-d7b7-47d8-956d-838b79396da7">distributed</a>, <a href="20240704134036-rest.html#ID-88828c6f-87e0-4569-b236-dc6ebb72d282">RESTful</a> <a href="20231215153109-search.html#ID-656af4b9-648b-41f9-932b-cbf2d2017794">search</a> and analytics engine.</li>
<li>Kibana: A visualization and exploration tool</li>
</ul>
</div>
</div>
<div id="outline-container-orgce067e6" class="outline-2">
<h2 id="orgce067e6"><span class="section-number-2">3.</span> Data Flow (Unbuffered)</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">

    [Web Server]:::B(Apache Logs)===O
                                     \
 [Load Balancer]:::::B(NGINX Logs)====O
                                       \
 [Application Server]::B(App Logs)======O--&gt;[Logstash]--&gt;[Elasticsearch]--&gt;[Kibana]
                                       /
 [Database]::B(MySQL Logs)============O

B = Beats
</pre>

<ul class="org-ul">
<li>Various sources (web server, app server, etc.) generate logs.</li>
<li>Beats installed on edge devices push these logs to logstash</li>
<li>Logstash collects, processes, and normalizes these diverse logs.</li>
<li>Processed logs are sent to Elasticsearch for indexing and storage.</li>
<li>Kibana queries and visualizes the indexed data from Elasticsearch.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfd53dad" class="outline-2">
<h2 id="orgfd53dad"><span class="section-number-2">4.</span> Data Flow (Buffered)</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
    [Web Server]:::B(Apache Logs)===O
                                     \
 [Load Balancer]:::::B(NGINX Logs)====O
                                       \   |  RMQ   |
 [Application Server]::B(App Logs)======O--| Buffer |--&gt;[Logstash]--&gt;[Elasticsearch]--&gt;[Kibana]
                                       /   | AKafka |
 [Database]::B(MySQL Logs)============O

B = Beats
</pre>
</div>
</div>

<div id="outline-container-org67efc42" class="outline-2">
<h2 id="org67efc42"><span class="section-number-2">5.</span> Installation</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>check out <a href="https://logz.io/learn/complete-guide-elk-stack/#installing-elk">https://logz.io/learn/complete-guide-elk-stack/#installing-elk</a></li>
<li>docker + <a href="20240704150351-configuration_management.html#ID-abbce407-072f-4c39-9580-a8d6256dbe69">config managment</a> systems</li>
</ul>
</div>
</div>
<div id="outline-container-org856aeef" class="outline-2">
<h2 id="org856aeef"><span class="section-number-2">6.</span> diff w/ <a href="20240704135955-monitoring.html#ID-8f401b28-efb8-49e3-b1c6-02f101341669">Monitoring</a></h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Log Management (e.g., BLEK)</th>
<th scope="col" class="org-left">Monitoring (e.g., Prometheus)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Focus</td>
<td class="org-left">Textual log data analysis</td>
<td class="org-left">Numerical time-series metrics</td>
</tr>

<tr>
<td class="org-left">Data Structure</td>
<td class="org-left">Unstructured or semi-structured</td>
<td class="org-left">Structured, numerical</td>
</tr>

<tr>
<td class="org-left">Data Collection</td>
<td class="org-left">Centralized from various sources</td>
<td class="org-left">Pull-based from instrumented systems</td>
</tr>

<tr>
<td class="org-left">Use Cases</td>
<td class="org-left">Troubleshooting, security auditing</td>
<td class="org-left">Performance monitoring, alerting</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org86c119c" class="outline-2">
<h2 id="org86c119c"><span class="section-number-2">7.</span> Pre-emptive v Reactive Analysis</h2>
</div>

<div id="outline-container-orgd0d5217" class="outline-2">
<h2 id="orgd0d5217"><span class="section-number-2">8.</span> Resources</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="https://www.elastic.co/elastic-stack">https://www.elastic.co/elastic-stack</a></li>
<li><a href="https://logz.io/learn/complete-guide-elk-stack/">https://logz.io/learn/complete-guide-elk-stack/</a></li>
<li><a href="https://github.com/deviantony/docker-elk">https://github.com/deviantony/docker-elk</a></li>
<li><a href="https://github.com/opensearch-project/OpenSearch">https://github.com/opensearch-project/OpenSearch</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Raj Patil</p>
<p class="date">Created: 2024-07-05 Fri 12:27</p>
</div>
</body>
</html>
